//********************************************************************************************
//* 2. Напишите программу, вычисляющую диаметр и длину окружности по заданной площади круга. *
//* Площадь круга должна вводиться пользователем с клавиатуры.                               *
//********************************************************************************************

package main

import (
	"fmt"
	"math"
)

func main() {
	var (
		s float64
	)

	fmt.Print("Введите площадь круга: ")
	fmt.Scan(&s)

	d := 2 * math.Sqrt(s/math.Pi)
	l := math.Pi * d
	fmt.Printf("Диаметр круга = %f\n", d)
	fmt.Printf("Длина окружности = %f\n", l)
}
